<!DOCTYPE html>
<html>
  <head><meta charset="utf-8">
    <title>Le comput eccl&eacute;siastique de Schwilgu&eacute; (1821)</title>
  </head>

<SCRIPT type="text/javascript">
  function JavaBlink() {
     var blinks = document.getElementsByTagName('JavaBlink');
     for (var i = blinks.length - 1; i >= 0; i--) {
        var s = blinks[i];
        s.style.visibility = (s.style.visibility === 'visible') ? 'hidden' : 'visible';
     }
     window.setTimeout(JavaBlink, 1000);
  }
  if (document.addEventListener) document.addEventListener("DOMContentLoaded", JavaBlink, false);
  else if (window.addEventListener) window.addEventListener("load", JavaBlink, false);
  else if (window.attachEvent) window.attachEvent("onload", JavaBlink);
  else window.onload = JavaBlink;
</SCRIPT>
  
  <body>

    <center>
    <h1>Le comput eccl&eacute;siastique de Schwilgu&eacute; (1821)</h1>
    <h2>&Eacute;tude et description compl&egrave;te</h2>
    </center>

    <center>
    <JavaBlink><p style="width:500px;border: 1px solid black;color: #123456;">
	Mme la donatrice, pouvez-vous SVP entrer en contact avec moi
	afin que je puisse avancer la documentation du comput&nbsp;?
	Merci d'avance&nbsp;!
    </p> </JavaBlink>
    </center>
    
    
    

<p>En plus d'un grand nombre d'autres éléments intéressants, <a href="https://fr.wikipedia.org/wiki/Horloge_astronomique_de_Strasbourg">l'horloge astronomique de la cath&eacute;drale de Strasbourg</a> comporte aussi
un comput eccl&eacute;siastique construit par <a href="https://fr.wikipedia.org/wiki/Jean-Baptiste_Schwilgu%C3%A9">Jean-Baptiste Schwilgu&eacute;</a> entre 1838 et 1842. Ce m&eacute;canisme ing&eacute;nieux permet de d&eacute;terminer les &eacute;l&eacute;ments du comput eccl&eacute;siastique (nombre d'or, cycle solaire, indiction, lettre dominicale et &eacute;pacte) ainsi que la <a href="https://fr.wikipedia.org/wiki/Calcul_de_la_date_de_P%C3%A2ques">date de P&acirc;ques</a> d'ann&eacute;e en ann&eacute;e.

<p>Ce m&eacute;canisme est en fait une version agrandie d'un <a href="https://fr.wikipedia.org/wiki/Mod%C3%A8le_de_comput_de_Schwilgu%C3%A9">prototype que Schwilgu&eacute; avait construit en 1821</a> et qui a longtemps &eacute;t&eacute; cru perdu. On en avait en effet perdu la trace vers 1945.

<p>Or, coup de th&eacute;&acirc;tre, fin 2021, peut-&ecirc;tre pour le bicentenaire de sa construction, une descendante d'une filleule d'une descendante de Schwilgu&eacute; a fait don de ce m&eacute;canisme &agrave; la fabrique de la cath&eacute;drale de Strasbourg.

<p>L'archev&ecirc;que de Strasbourg, <a href="https://fr.wikipedia.org/wiki/Luc_Ravel">Monseigneur Luc Ravel</a>, a pris les choses en main et a choisi de ne pas lancer de travaux scientifiques sur le comput, mais de commencer par publier un <a href="http://www.verger-editeur.fr/Le-maitre-des-horloges">roman policier</a>. Ce roman est paru en avril 2023.

<p>Cependant, en novembre 2022, alors que le roman &eacute;tait achev&eacute;,
l'&eacute;v&ecirc;ch&eacute; a d&eacute;cid&eacute; d'en autoriser l'&eacute;tude (c'est bizarre, mais c'est comme cela). Ayant grandement travaill&eacute;
sur l'horloge astronomique et notamment sur son comput (dont j'avais r&eacute;alis&eacute; une mod&eacute;lisation 3D partielle en 2001-2002), ayant aussi
travaill&eacute; aux algorithmes de calcul de la date de P&acirc;ques
(voir notamment mon <a href="https://inria.hal.science/inria-00099868/document">&eacute;tude sur l'&eacute;pacte 19</a> et sur le <a href="https://tug.org/tugboat/tb30-1/tb94roegel-garrigues.pdf">nomogramme
de Garrigues</a>), et &eacute;tant &agrave; l'origine du comit&eacute; scientifique de l'horloge astronomique (dont j'ai d&eacute;missionn&eacute; en 2012, parce que la fabrique bloquait la recherche scientifique), j'ai &eacute;t&eacute; associ&eacute; &agrave; partir de d&eacute;cembre 2022 &agrave; cette &eacute;tude. De d&eacute;cembre 2022 &agrave; avril 2023, j'ai organis&eacute; l'&eacute;tude et l'intervention sur le comput, notamment son d&eacute;montage. Ce travail a &eacute;t&eacute; fait en collaboration avec Jean-Pierre Rieb, et finalement avec Ludovic Faullimmel qui nous a assist&eacute;s pour le d&eacute;montage, nettoyage et remontage fin mars 2023.

<p>Pendant ces travaux, le comput a &eacute;t&eacute; examin&eacute; sous
toutes ses coutures, des mesures ont &eacute;t&eacute; prises, des plans
ont &eacute;t&eacute; r&eacute;alis&eacute;s, de nombreuses photographies
ont &eacute;t&eacute; prises, des relev&eacute;s XRF ont &eacute;t&eacute; faits, tout ceci permettant de r&eacute;aliser une documentation exceptionnelle
  et m&ecirc;me unique.

  <center>
    <img src="img/comput1821-grand-rateau.jpg" width="700"><br>
    Extrait du modèle 3D du comput de 1821.
  </center>
  

<p>Il faut en effet savoir que la presque totalit&eacute; des horloges
et autres m&eacute;canismes ne sont jamais proprement document&eacute;s,
  m&ecirc;me dans de grands mus&eacute;es comme le Louvre (par exemple
  pour la pendule de la Cr&eacute;ation du Monde o&ugrave; la soit-disante
  documentation de la restauration se r&eacute;duit &agrave; 20 pages sans
  aucune photographie&nbsp;!) ou le ch&acirc;teau
  de Versailles (la restauration de la pendule de Passemant n'a pour l'instant
  donn&eacute; lieu qu'&agrave; un article cribl&eacute; d'erreurs
  dans le bulletin de l'AFAHA de juin 2023),
  et m&ecirc;me lorsque les interventions sont supervis&eacute;es par la DRAC
  (par exemple pour certaines horloges class&eacute;es en Alsace,
  o&ugrave; des &eacute;l&eacute;ments ont &eacute;t&eacute; perdus lors
  de la restauration, ou tout simplement pour l'horloge astronomique,
  lors de la restauration de 2001-2002).
  Une intervention sur un m&eacute;canisme complexe n&eacute;cessite
l'intervention conjointe de chercheurs et de restaurateurs, pas simplement
de restaurateurs qui n'ont pas la formation et l'exp&eacute;rience
de la documentation et des publications. C'est pour cela que notre
travail devrait &ecirc;tre une &eacute;tape fondamentale et exemplaire.

<p>Malheureusement, mon travail n'est pas tout-&agrave;-fait achev&eacute;.
  Pour l'achever, j'ai actuellement besoin de deux choses&nbsp;:

  <ul>
    <li>Je souhaite entrer en contact avec la donatrice du comput,
      pour lui poser un certain nombre de questions, et afin que l'historique
      du m&eacute;canisme ne soit pas perdu. Bien &eacute;videmment,
      je garderai ce contact confidentiel.
    <li>J'ai aussi besoin de r&eacute;aliser certains tests sur le comput
      de l'horloge astronomique, &agrave; des fins de comparaison. Or,
      depuis peu, l'acc&egrave;s &agrave; l'horloge est devenu beaucoup
      plus difficile car la DRAC et l'architecte de la cath&eacute;drale
      ont impos&eacute; des r&egrave;gles d'acc&egrave;s dissuasives,
      notamment en demandant
      d'envoyer par courrier &eacute;lectronique des copies de pi&egrave;ces
      d'identit&eacute;, ce qui est ill&eacute;gal selon la CNIL. Je refuse
      d'entrer dans l'horloge astronomique dans de telles conditions,
      et notamment si la DRAC persiste &agrave; d&eacute;nigrer les chercheurs
      comme moi.
  </ul>
  

  <p>Ce n'est que lorsque les deux points pr&eacute;c&eacute;dents auront
  &eacute;t&eacute; satisfaits que je pourrai achever mon travail de
  documentation. Sans cela, mon travail ne pourra pas &ecirc;tre publi&eacute;
    et il est alors fort probable que le comput de 1821
    ne sera jamais document&eacute; scientifiquement.

  <p>D'autres pages en rapport avec l'horloge astronomique&nbsp;:
    <ul>
      <li><a href="https://roegeld.github.io/stimmer/">Les peintures de Stimmer sur l'horloge astronomique</a></li>
    </ul>
    <p>Denis Roegel, 26 décembre 2024.
  </body>
</html>
